<a href="https://colab.research.google.com/github/suchith1012/AOML_Project/blob/main/AOML_Project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [11]:
import pandas as pd
import numpy as np

In [12]:
O_data=pd.read_csv('/content/sample_data/resume_dataset.csv')

In [13]:
O_data

         Category                                             Resume
0    Data Science  Skills * Programming Languages: Python (pandas...
1    Data Science  Education Details \r\nMay 2013 to May 2017 B.E...
2    Data Science  Areas of Interest Deep Learning, Control Syste...
3    Data Science  Skills â¢ R â¢ Python â¢ SAP HANA â¢ Table...
4    Data Science  Education Details \r\n MCA   YMCAUST,  Faridab...
..            ...                                                ...
164       Testing  Computer Skills: â¢ Proficient in MS office (...
165       Testing  â Willingness to accept the challenges. â ...
166       Testing  PERSONAL SKILLS â¢ Quick learner, â¢ Eagerne...
167       Testing  COMPUTER SKILLS & SOFTWARE KNOWLEDGE MS-Power ...
168       Testing  Skill Set OS Windows XP/7/8/8.1/10 Database MY...

[169 rows x 2 columns]

In [14]:
O_data.describe()

              Category                                             Resume
count              169                                                169
unique              25                                                166
top     Java Developer  TECHNICALSKILLS SpringMVC, Hibernate, JDBC, Ja...
freq                14                                                  2

In [15]:
O_data['processed_resume']=''

In [16]:
O_data.describe()

              Category  ... processed_resume
count              169  ...              169
unique              25  ...                1
top     Java Developer  ...
freq                14  ...              169

[4 rows x 3 columns]

# Text Preprocessing

### Convert text to lowercase

In [17]:
O_data['processed_resume']=O_data['Resume'].str.lower()

In [18]:
O_data.head()

       Category  ...                                   processed_resume
0  Data Science  ...  skills * programming languages: python (pandas...
1  Data Science  ...  education details \r\nmay 2013 to may 2017 b.e...
2  Data Science  ...  areas of interest deep learning, control syste...
3  Data Science  ...  skills â¢ r â¢ python â¢ sap hana â¢ table...
4  Data Science  ...  education details \r\n mca   ymcaust,  faridab...

[5 rows x 3 columns]

### Removal of Punctuations

In [20]:
O_data["processed_resume"] = O_data['processed_resume'].str.replace('[^\w\s]','')

In [21]:
O_data

         Category  ...                                   processed_resume
0    Data Science  ...  skills  programming languages python pandas nu...
1    Data Science  ...  education details \r\nmay 2013 to may 2017 be ...
2    Data Science  ...  areas of interest deep learning control system...
3    Data Science  ...  skills â r â python â sap hana â tableau â sap...
4    Data Science  ...  education details \r\n mca   ymcaust  faridaba...
..            ...  ...                                                ...
164       Testing  ...  computer skills â proficient in ms office word...
165       Testing  ...  â willingness to accept the challenges â posit...
166       Testing  ...  personal skills â quick learner â eagerness to...
167       Testing  ...  computer skills  software knowledge mspower po...
168       Testing  ...  skill set os windows xp788110 database mysql s...

[169 rows x 3 columns]

### Removal of stopwords

In [24]:
from nltk.corpus import stopwords
stopwords_list = set(stopwords.words('english'))

In [25]:
stopwords_list

{'a',
 'about',
 'above',
 'after',
 'again',
 'against',
 'ain',
 'all',
 'am',
 'an',
 'and',
 'any',
 'are',
 'aren',
 "aren't",
 'as',
 'at',
 'be',
 'because',
 'been',
 'before',
 'being',
 'below',
 'between',
 'both',
 'but',
 'by',
 'can',
 'couldn',
 "couldn't",
 'd',
 'did',
 'didn',
 "didn't",
 'do',
 'does',
 'doesn',
 "doesn't",
 'doing',
 'don',
 "don't",
 'down',
 'during',
 'each',
 'few',
 'for',
 'from',
 'further',
 'had',
 'hadn',
 "hadn't",
 'has',
 'hasn',
 "hasn't",
 'have',
 'haven',
 "haven't",
 'having',
 'he',
 'her',
 'here',
 'hers',
 'herself',
 'him',
 'himself',
 'his',
 'how',
 'i',
 'if',
 'in',
 'into',
 'is',
 'isn',
 "isn't",
 'it',
 "it's",
 'its',
 'itself',
 'just',
 'll',
 'm',
 'ma',
 'me',
 'mightn',
 "mightn't",
 'more',
 'most',
 'mustn',
 "mustn't",
 'my',
 'myself',
 'needn',
 "needn't",
 'no',
 'nor',
 'not',
 'now',
 'o',
 'of',
 'off',
 'on',
 'once',
 'only',
 'or',
 'other',
 'our',
 'ours',
 'ourselves',
 'out',
 'over',
 'own',
 're',
 's',
 'same',
 'shan',
 "shan't",
 'she',
 "she's",
 'should',
 "should've",
 'shouldn',
 "shouldn't",
 'so',
 'some',
 'such',
 't',
 'than',
 'that',
 "that'll",
 'the',
 'their',
 'theirs',
 'them',
 'themselves',
 'then',
 'there',
 'these',
 'they',
 'this',
 'those',
 'through',
 'to',
 'too',
 'under',
 'until',
 'up',
 've',
 'very',
 'was',
 'wasn',
 "wasn't",
 'we',
 'were',
 'weren',
 "weren't",
 'what',
 'when',
 'where',
 'which',
 'while',
 'who',
 'whom',
 'why',
 'will',
 'with',
 'won',
 "won't",
 'wouldn',
 "wouldn't",
 'y',
 'you',
 "you'd",
 "you'll",
 "you're",
 "you've",
 'your',
 'yours',
 'yourself',
 'yourselves'}

In [26]:
def remove_stopwords(text):
    return " ".join([word for word in str(text).split() if word not in stopwords_list])

In [27]:
O_data["processed_resume"] = O_data["processed_resume"].apply(lambda text: remove_stopwords(text))
O_data.head()

       Category  ...                                   processed_resume
0  Data Science  ...  skills programming languages python pandas num...
1  Data Science  ...  education details may 2013 may 2017 uitrgpvdat...
2  Data Science  ...  areas interest deep learning control system de...
3  Data Science  ...  skills â r â python â sap hana â tableau â sap...
4  Data Science  ...  education details mca ymcaust faridabad haryan...

[5 rows x 3 columns]